<?php
$v1 = 5;
$v2 = 3;
$r1 = $v1 +$v2;
echo "r1 = $r1";
/*
cpu内部运算模拟示意：
5:	00000101	(既是原码，又是补码）
3:	00000011	(既是原码，又是补码）
+
--------------
	00001000
可见，就是2的3次方（8)
*/



$v1 = 5;
$v2 = 3;
$r1 = $v1 - $v2;
echo "r1 = $r1";
//实际应用中，cpu中的相减，会被转换为相加运算
//因为只要对减数取负就得到一个新的负数，然后相加
//类似这样：$r1 = $v1 + (-$v2)

/*
cpu内部运算模拟示意：
5:	00000101	(既是原码，又是补码）
3:	00000011	(既是原码，又是补码）
-3: 10000011	(原码)
-3: 11111100	(反码)
-3: 11111101	(补码)
//下面开始计算：5+(-3):
5:	00000101	(补码）
-3: 11111101	(补码)
+
-----------------------
	00000010	(补码)
可见得到的结果是补码为2的值，则其原码自然也是2
*/


?>